#include <iostream>
#include <cmath>  // Для использования exp
using namespace std;

// Определяем функцию f(x) = exp(x) + 6
double f(double x) {
    return exp(x) + 6; // Возвращаем значение функции
}

int main() {
    // Инициализация переменных
    double a = 5; // Начало интервала
    double b = 11; // Конец интервала
    int n = 200; // Количество отрезков
    double h = (b - a) / n; // Вычисление шага
    double x = a; // Начальное значение x
    double s = 0; // Начальное значение суммы

    // Цикл для вычисления суммы методом трапеций
    while (x <= (b - h)) {
        s += h * (f(x) + f(x + h)) / 2; // Добавляем площадь трапеции
        x += h; // Переход к следующему шагу
    }

    // Вывод результата
    cout << "Результат интегрирования: S = " << s << endl;

    return 0;
}