#include <iostream>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main() {
    setlocale(LC_CTYPE, "Russian");
    int n, i;
    int* A; // указатель для динамического массива
    int max, count = 0;
    char buffer[100]; // Буфер для ввода

    // Ввод размерности массива
    printf("Введите количество элементов массива: ");
    if (fgets(buffer, sizeof(buffer), stdin) != NULL) { // Чтение строки с ввода с помощью fgets (вместо scanf). NULL - нулевой указатель
        n = atoi(buffer); // Преобразование строки в целое число
    }

    // Проверка на корректность ввода
    if (n <= 0) {
        printf("Неверный размер массива. Программа завершена.\n");
        return 1;
    }

    A = (int*)malloc(n * sizeof(int)); // выделяется динамическая память для массива A размером n элементов. Используется sizeof(int) для получения размера одного элемента
    if (A == NULL) { //Проверяется, удалось ли выделить память
        printf("Ошибка выделения памяти.\n");
        return 1;
    }

    printf("Введите элементы массива:\n");
    for (i = 0; i < n; i++) {
        printf("Элемент %d: ", i + 1);
        if (fgets(buffer, sizeof(buffer), stdin) != NULL) { // sizeof(buffer) возвращает размер массива buffer в байтах. stdin - стандартный поток ввода, обычно используется для чтения данных с клавиатуры.
            A[i] = atoi(buffer); // Преобразование строки в целое число
        }
    }

    // Нахождение максимального элемента массива
    max = A[0];
    for (i = 1; i < n; i++) {
        if (A[i] > max) {
            max = A[i];
        }
    }

    // Подсчет количества вхождений максимального элемента
    for (i = 0; i < n; i++) {
        if (A[i] == max) {
            count++;
        }
    }

    printf("Максимальное число: %d\n", max);
    printf("Количество вхождений максимального числа: %d\n", count);

    free(A); // Освобождение выделенной памяти

    return 0;
}