// -- решение задачи об оптимальной загрузке судна  
//    функция возвращает доход от перевозки выбранных контейнеров
#pragma once 
#include "Combi.h"

// Простая версия (без центровки)
int boat(
    int V,         // [in] максимальный вес груза
    short m,       // [in] количество мест для контейнеров     
    short n,       // [in] всего контейнеров  
    const int v[], // [in] вес каждого контейнера  
    const int c[], // [in] доход от перевозки каждого контейнера     
    short r[]      // [out] результат: индексы выбранных контейнеров
);

// Версия с центровкой (для варианта 12)
int boat_c(
    short m,           // [in] количество мест для контейнеров
    const int minv[],  // [in] минимальный вес контейнера на каждом месте
    const int maxv[],  // [in] максимальный вес контейнера на каждом месте
    short n,           // [in] всего контейнеров
    const int v[],     // [in] вес каждого контейнера
    const int c[],     // [in] доход от перевозки каждого контейнера
    short r[]          // [out] номера выбранных контейнеров (размещение)
);