#pragma once

namespace combi
{
    // Генератор множества всех подмножеств
    struct subset
    {
        short n;                 // количество элементов исходного множества (< 64)
        short sn;                // количество элементов текущего подмножества
        short* sset;             // массив индексов текущего подмножества
        unsigned __int64 mask;   // битовая маска

        subset(short n = 1);     // конструктор
        short getfirst();        // сформировать массив индексов по битовой маске
        short getnext();         // ++маска и сформировать массив индексов
        short ntx(short i);      // получить i-й элемент массива индексов
        unsigned __int64 count();// вычислить общее количество подмножеств
        void reset();            // сбросить генератор, начать сначала
    };

    // Генератор сочетаний (эвристика)
    struct xcombination
    {
        short n;                 // количество элементов исходного множества
        short m;                 // количество элементов в сочетаниях
        short* sset;             // массив индексов текущего сочетания
        unsigned __int64 nc;      // номер сочетания 0,..., count()-1

        xcombination(short n = 1, short m = 1);
        void reset();            // сбросить генератор, начать сначала
        short getfirst();        // сформировать первый массив индексов
        short getnext();         // сформировать следующий массив индексов
        short ntx(short i);      // получить i-й элемент массива индексов
        unsigned __int64 count() const; // вычислить количество сочетаний
    };

    // Генератор перестановок (алгоритм Джонсона-Троттера)
    struct permutation
    {
        const static bool L = true;   // левая стрелка
        const static bool R = false;  // правая стрелка

        short n;                 // количество элементов исходного множества
        short* sset;             // массив индексов текущей перестановки
        bool* dart;              // массив стрелок (левых-L и правых-R)
        unsigned __int64 np;      // номер перестановки 0,..., count()-1

        permutation(short n = 1);
        void reset();            // сбросить генератор, начать сначала
        __int64 getfirst();      // сформировать первый массив индексов
        __int64 getnext();       // сформировать следующий массив индексов
        short ntx(short i);      // получить i-й элемент массива индексов
        unsigned __int64 count() const; // вычислить общее количество перестановок
    };

    // Генератор размещений (комбинация сочетаний и перестановок)
    struct accomodation
    {
        short n;                 // количество элементов исходного множества
        short m;                 // количество элементов в размещении
        short* sset;             // массив индексов текущего размещения
        xcombination* cgen;      // указатель на генератор сочетаний
        permutation* pgen;       // указатель на генератор перестановок
        unsigned __int64 na;      // номер размещения 0,..., count()-1

        accomodation(short n = 1, short m = 1);
        void reset();            // сбросить генератор, начать сначала
        short getfirst();        // сформировать первый массив индексов
        short getnext();         // сформировать следующий массив индексов
        short ntx(short i);      // получить i-й элемент массива индексов
        unsigned __int64 count() const; // вычислить общее количество размещений
    };

};